let handler = async (m, { conn }) => {
    const name = conn.getName(m.sender);
    let videoUrl = 'https://telegra.ph/file/9c0cc8983a7d605d664f3.mp4';
    let tagUser = '@' + m.sender.split("@s.whatsapp.net")[0];
    let more = String.fromCharCode(8206);
    let teks = `${pickRandom([`
╭━━━[ *قائمه الاوامر* ]━━━━⬣
┃ *↵ اهلا يا روحي "${name}" معاك بوت اسمي ساسكي "*
╰━━━〔 *🛡️ 1.4.9* 〕━━━━━⬣
╭━━━[ *المعلومات الخاصه ب المطور و البوت* ]━━━━⬣
┇اسم البوت🤖: *ساسكي
┇اسم المالك👑: *ايتاتشي*
┇المنصه📡: *ريبلايت*
╰━━━〔 *🛡️ 1.4.9* 〕━━━━━⬣
╭━━━[ *اليك قائمه اوامر البوت* ]━━━━⬣
*حط نقطه قبل اي امر*
╭━━━[ *العاب البوت 🤖* ]━━━━⬣
*🎆احزر*
*🎆كوره*
*🎆علم*
*🎆عين*
*🎆 مانغا*
*🎆شخصيه*
*🎆رياضيات*
*🎆شطرنج*
*🎆تفكيك*
*🎆اكس او*
*🎆لعبه*
*🎆صيد*
*🎆سؤال*
*🎆ديني*
╭━━━[ *قسم البنك و جمع الاكسبي و الالماس 🏦* ]━━━━⬣
*💸التفعيل مثال التفعيل.ايتاتشي.15*
*💸تسجيل-خروج*
*💸راتب*
*💸رهان*
*💸شراء-جواهر*
*💸عديه*
*💸شراء-الماس*
*💸يومي*
*💸البنك*
*💸المتصدرين*
*💸لفل*
*💸الماسي*
*💸تعدين*
*💸عمله2*
*💸هجوم*
*💸رمزي*
╭━━━[ *صور 🖼️* ]━━━━⬣
*⚽رونالدو*
*⚽ميسي*
*⚽قدوتي*
*⚽بلاك-بينك*
*⚽حكمه*
*⚽قط*
*⚽خلفيه*
*⚽تطقيم*
╭━━━[ *اوامر السوشيال ميديا و التحميل 🔃* ]━━━━⬣
*🌊يوتيوبي*
*🌊تطبيق*
*🌊الطقس*
*🌊تحسين*
*🌊التوقيت*
*🌊الوان*
*🌊بوليس*
*🌊بلور*
*🌊تشويش*
*🌊تفريغ*
*🌊انمي*
*🌊فيلم*
*🌊شغل*
*🌊توكتوك*
*🌊انستغرام*
*🌊تلوكولر*
*🌊انمي*
*🌊جيتهوب*
*🌊تحميل*
*🌊فيسبوك*
*🌊فريبيك*
*🌊متجر*
*🌊بحث*
*🌊صوره*
*🌊تخيل*
*🌊انستا*
*🌊تيك*
*🌊صوت*
*🌊تحسين*
*🌊لكرتون*
*🌊لفيديو*
╭━━━[ *قسم المطور 🤴🏻* ]━━━━⬣
*🌟اعلان*
*🌟فيروس*
*🌟بريم*
*🌟خفض-التميز*
*🌟نظف*
*🌟اضف-اكسبي*
*🌟اضف-الماس*
*🌟نشر*
*🌟حظر*
*🌟المحظورين*
*🌟sp*
*🌟 اضف-مطور*
*🌟فرمت*
*🌟بان*
*🌟بلوك*
*🌟اين-الخطاء*
*🌟بوليجون*
*🌟رسترات*
*🌟رفع-بلوك*
*🌟البلوكات*
*🌟فك-الحظر*
*🌟انضم*
*🌟اخرج*
*🌟فك-البان*
╭━━━[ *اوامر المرح 🎡* ]━━━━⬣
*🤡كذبتي*
*🤡رجولتي*
*🤡شبيهي*
*🤡لو*
*🤡ظهر*
*🤡تسريع*
*🤡السرعه*
*🤡خط*
*🤡زخرفه*
*🤡فزوره*
*🤡الشخصيه*
*🤡صراحه*
*🤡انصح*
*🤡تاج*
*🤡تهكير*
*🤡غباء*
*🤡الحب*
*🤡كت*
*🤡هل*
╭━━━[ *اوامر الجروبات و المجموعات 🐉* ]━━━━⬣
*🦕انذار*
*🦕الغاء-الانذار*
*🦕احذف*
*🦕ابلاغ*
*🦕الجروب*
*🦕الجروبات*
*🦕دعوه*
*🦕تغير-الوصف*
*🦕تغير-الاسم*
*🦕تغير-الترحيب*
*🦕تغير-الصوره*
*🦕تغير-اللينك*
*🦕الدعم*
*🦕تغير-الوداع*
*🦕تغير-الترحيب*
*🦕منشن*
*🦕مخفي*
*🦕لمنشن*
*🦕منشني*
*🦕جروب فتح*
*🦕جروب غلق*
*🦕اكشف*
*🦕لينك*
*🦕المشرفين*
*🦕الاشباح*
*🦕مغير الصوت*
*🦕عميق*
*🦕منفوخ*
*🦕تخين*
*🦕صاخب*
*🦕سريع*
*🦕رفيع*
*🦕تقطيع*
*🦕روبوت*
*🦕بطيء*
*🦕ناعم*
*🦕سنجاب*
*خاص ب الاصوات✌🏻*
*🦕انطق*
*🦕الدعم*
╭━━━[ *اوامر الملصقات 💫* ]━━━━⬣
*🐦دمج*
*🐦ملصق*
*🐦سرقه*
*🐦مدور*
*🐦ستك*
*🐦تعليق*
╭━━━[ *اوامر الدين 💓* ]━━━━⬣
*🕋دين*
*🕋ايات*
*🕋اسماء-الله*
*🕋اذكار الصباح*
*🕋اذكار المساء*

*❶ - يمنع منعا بتا سب البوت.*
*❷ - استخدام البوت بشكل متوازن و بدون تسبب ازعاج للاعضاء.*

~⌬ تــ✍︎ــوقــيــعي
*MOHAMED ITACHI KUN*

╰━━━〔 *🛡️ 1.4.9* 〕━━━━━⬣`])}`.trim();

    conn.sendMessage(m.chat, {
        video: { url: videoUrl },
        caption: teks,
        gifPlayback: true,
        gifAttribution: 0
    }, { quoted: m });
};

handler.command = ['menu', 'help', 'h', 'اوامر', 'مهام', 'الاوامر', 'المهام'];

export default handler;

function pickRandom(list) {
    return list[Math.floor(Math.random() * list.length)];
                   }