let handler = m => m; 
 handler.all = async function (m) { 
   let chat = global.db.data.chats[m.chat]; 
   let responses; 
   if (/ساسكي بحبك|ساسكي عاوزه اتجوزك|بحبك|بموت فيك|نتجوز|ساسكي هنتجوز امتي|ساسكي انت ليا|ساسكي بموت فيك$/i.test(m.text)) { 
     responses = [ 
       'شكرا  ',  
       'هفكر في الموضوع',  
             'و انا',  
                   'استحيت',  
                         'خلاص لا اتكسف ',  
                               'اسكتتتتت عشان مضربكش عيب الكلام ده   ',  
                                     'طيب و بعدين '  
     ]; 
} else if (/^السلام عليكم|سلام عليكم ورحمه الله وبركاته|سلام عليكم|السلام عليكم ورحمه الله وبركاته$/i.test(m.text)) { 
     responses = [ 
       'وعليكم السلام',  
          'وعليكم السلام حبي متور',  
              ' وعليكم السلام كيفك',  
                   'وعليكم السلام ورحمة الله وبركاته' 
     ]; 
   }else if (/^ ساسكي عامل ايه|عامله ايه|عاملين ايه|الدنيا عامله ايه|عاملين ايه يشبب$/i.test(m.text)) { 
     responses = [ 
       '🥰كل شيء بخير الحمد لله ',  
          '🌚🐦 مش عارف  ',  
              '🙂 الحمد لله ماشي الحال ',  
                  '❤️الحمد الله',  
                      ' لو انت كويس انا كويس' 
     ]; 
   }else if (/^كل خرا|عرص|خول|اطفو|كسمك|علق$/i.test(m.text)) { 
     responses = [ 
       'انت يا روحي ',  
          ' اتأدب ',  
              ' يا وسخ '
     ]; 
 }else if (/^تم تعريب هذا الامر|تم الانتهاء|تمت اضافه|تمت اضافة|تم التعريب|هذا الامر انتهي$/i.test(m.text)) { 
     responses = [ 
       ' عاشت ايدك ✨💜',  
           'تسلم ايدك ✨💜 ',  
                'عاش ✨💜 ',  
                  'عاش ايتاتشي ✨💜',  
                   'اوكي ✨💜' 
     ]; 
   }else if (/^لول|هههه|ههههه|هههههه|ههههههه|هههههههه|😂😂😂$/i.test(m.text)) { 
     responses = [ 
       '😂😂😂❤️دوم دي ضحكة ',  
            ' 🐦ضحكني معاك',  
                   'دوم يا رب ❤️ ',  
                         'ههه🗿 ',  
                         '😂😂😂❤️',  
                         'ايه ال بيضحك🌚',  
                         '😂❤️',  
                             '🥺❤️دوم ' 
   ];  
   }else if (/^تشفير$/i.test(m.text)) { 
     responses = [ 
        'روح نام'
  ]; 
   }else if (/^اسكت|اسكت|هتسكت امتي|اسكت$/i.test(m.text)) { 
     responses = [ 
             '🥺💔ملكش دعوه ', 
              '🥺 لا وانت مالك',  
                 '😏 مش بمزاجك',  
                 'لا مين انت ال هتسكتني🗿 ',  
                   '🙃اسكت انت' 
     ]; 
    }  
   if (responses) { 
     let randomIndex = Math.floor(Math.random() * responses.length); 
     conn.reply(m.chat, responses[randomIndex], m); 
   } 
   return !0 
 }; 
  
 export default handler;